RT-Thread/rt-thread/bsp/freescale/platform/devices/MK52D10/include/MK52D10_extension.h
/*******************************************************************************
 * ENET_RDAR - Receive Descriptor Active Register
 ******************************************************************************/

/*!
 * @brief ENET_RDAR - Receive Descriptor Active Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * RDAR is a command register, written by the user, to indicate that the receive
 * descriptor ring has been updated, that is, that the driver produced empty
 * receive buffers with the empty bit set. When the register is written, the RDAR
 * bit is set. This is independent of the data actually written by the user. When
 * set, the MAC polls the receive descriptor ring and processes receive frames,
 * provided ECR[ETHER_EN] is also set. After the MAC polls a receive descriptor
 * whose empty bit is not set, MAC clears RDAR and ceases receive descriptor ring
 * polling until the user sets the bit again, signifying that additional
 * descriptors have been placed into the receive descriptor ring. The RDAR register is
 * cleared at reset and when ECR[ETHER_EN] transitions from set to cleared or when
 * ECR[RESET] is set.
 */
/*!
 * @name Constants and macros for entire ENET_RDAR register
 */
/*@{*/
#define ENET_RD_RDAR(base)       (ENET_RDAR_REG(base))
#define ENET_WR_RDAR(base, value) (ENET_RDAR_REG(base) = (value))
#define ENET_RMW_RDAR(base, mask, value) (ENET_WR_RDAR(base, (ENET_RD_RDAR(base) & ~(mask)) | (value)))
#define ENET_SET_RDAR(base, value) (ENET_WR_RDAR(base, ENET_RD_RDAR(base) |  (value)))
#define ENET_CLR_RDAR(base, value) (ENET_WR_RDAR(base, ENET_RD_RDAR(base) & ~(value)))
#define ENET_TOG_RDAR(base, value) (ENET_WR_RDAR(base, ENET_RD_RDAR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RDAR bitfields
 */

/*!
 * @name Register ENET_RDAR, field RDAR[24] (RW)
 *
 * Always set to 1 when this register is written, regardless of the value
 * written. This field is cleared by the MAC device when no additional empty
 * descriptors remain in the receive ring. It is also cleared when ECR[ETHER_EN]
 * transitions from set to cleared or when ECR[RESET] is set.
 */
/*@{*/
/*! @brief Read current value of the ENET_RDAR_RDAR field. */
#define ENET_RD_RDAR_RDAR(base) ((ENET_RDAR_REG(base) & ENET_RDAR_RDAR_MASK) >> ENET_RDAR_RDAR_SHIFT)
#define ENET_BRD_RDAR_RDAR(base) (BITBAND_ACCESS32(&ENET_RDAR_REG(base), ENET_RDAR_RDAR_SHIFT))

/*! @brief Set the RDAR field to a new value. */
#define ENET_WR_RDAR_RDAR(base, value) (ENET_RMW_RDAR(base, ENET_RDAR_RDAR_MASK, ENET_RDAR_RDAR(value)))
#define ENET_BWR_RDAR_RDAR(base, value) (BITBAND_ACCESS32(&ENET_RDAR_REG(base), ENET_RDAR_RDAR_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * ENET_TDAR - Transmit Descriptor Active Register
 ******************************************************************************/

/*!
 * @brief ENET_TDAR - Transmit Descriptor Active Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The TDAR is a command register that the user writes to indicate that the
 * transmit descriptor ring has been updated, that is, that transmit buffers have
 * been produced by the driver with the ready bit set in the buffer descriptor. When
 * the register is written, the TDAR bit is set. This value is independent of
 * the data actually written by the user. When set, the MAC polls the transmit
 * descriptor ring and processes transmit frames, provided ECR[ETHER_EN] is also set.
 * After the MAC polls a transmit descriptor that contains a ready bit that is
 * not set, the MAC clears TDAR and ceases transmit descriptor ring polling until
 * the user sets the bit again, signifying additional descriptors have been
 * placed into the transmit descriptor ring. The TDAR register is cleared at reset,
 * when ECR[ETHER_EN] transitions from set to cleared, or when ECR[RESET] is set.
 */
/*!
 * @name Constants and macros for entire ENET_TDAR register
 */
/*@{*/
#define ENET_RD_TDAR(base)       (ENET_TDAR_REG(base))
#define ENET_WR_TDAR(base, value) (ENET_TDAR_REG(base) = (value))
#define ENET_RMW_TDAR(base, mask, value) (ENET_WR_TDAR(base, (ENET_RD_TDAR(base) & ~(mask)) | (value)))
#define ENET_SET_TDAR(base, value) (ENET_WR_TDAR(base, ENET_RD_TDAR(base) |  (value)))
#define ENET_CLR_TDAR(base, value) (ENET_WR_TDAR(base, ENET_RD_TDAR(base) & ~(value)))
#define ENET_TOG_TDAR(base, value) (ENET_WR_TDAR(base, ENET_RD_TDAR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_TDAR bitfields
 */

/*!
 * @name Register ENET_TDAR, field TDAR[24] (RW)
 *
 * Always set to 1 when this register is written, regardless of the value
 * written. This bit is cleared by the MAC device when no additional ready descriptors
 * remain in the transmit ring. Also cleared when ECR[ETHER_EN] transitions from
 * set to cleared or when ECR[RESET] is set.
 */
/*@{*/
/*! @brief Read current value of the ENET_TDAR_TDAR field. */
#define ENET_RD_TDAR_TDAR(base) ((ENET_TDAR_REG(base) & ENET_TDAR_TDAR_MASK) >> ENET_TDAR_TDAR_SHIFT)
#define ENET_BRD_TDAR_TDAR(base) (BITBAND_ACCESS32(&ENET_TDAR_REG(base), ENET_TDAR_TDAR_SHIFT))

/*! @brief Set the TDAR field to a new value. */
#define ENET_WR_TDAR_TDAR(base, value) (ENET_RMW_TDAR(base, ENET_TDAR_TDAR_MASK, ENET_TDAR_TDAR(value)))
#define ENET_BWR_TDAR_TDAR(base, value) (BITBAND_ACCESS32(&ENET_TDAR_REG(base), ENET_TDAR_TDAR_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * ENET_ECR - Ethernet Control Register
 ******************************************************************************/

/*!
 * @brief ENET_ECR - Ethernet Control Register (RW)
 *
 * Reset value: 0xF0000000U
 *
 * ECR is a read/write user register, though hardware may also alter fields in
 * this register. It controls many of the high level features of the Ethernet MAC,
 * including legacy FEC support through the EN1588 field.
 */
/*!
 * @name Constants and macros for entire ENET_ECR register
 */
/*@{*/
#define ENET_RD_ECR(base)        (ENET_ECR_REG(base))
#define ENET_WR_ECR(base, value) (ENET_ECR_REG(base) = (value))
#define ENET_RMW_ECR(base, mask, value) (ENET_WR_ECR(base, (ENET_RD_ECR(base) & ~(mask)) | (value)))
#define ENET_SET_ECR(base, value) (ENET_WR_ECR(base, ENET_RD_ECR(base) |  (value)))
#define ENET_CLR_ECR(base, value) (ENET_WR_ECR(base, ENET_RD_ECR(base) & ~(value)))
#define ENET_TOG_ECR(base, value) (ENET_WR_ECR(base, ENET_RD_ECR(base) ^  (value)))
/*@}*/

