RT-Thread/rt-thread/bsp/freescale/platform/devices/MK52D10/include/MK52D10_extension.h
/*******************************************************************************
 * ENET_MMFR - MII Management Frame Register
 ******************************************************************************/

/*!
 * @brief ENET_MMFR - MII Management Frame Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Writing to MMFR triggers a management frame transaction to the PHY device
 * unless MSCR is programmed to zero. If MSCR is changed from zero to non-zero
 * during a write to MMFR, an MII frame is generated with the data previously written
 * to the MMFR. This allows MMFR and MSCR to be programmed in either order if
 * MSCR is currently zero. If the MMFR register is written while frame generation is
 * in progress, the frame contents are altered. Software must use the EIR[MII]
 * interrupt indication to avoid writing to the MMFR register while frame
 * generation is in progress.
 */
/*!
 * @name Constants and macros for entire ENET_MMFR register
 */
/*@{*/
#define ENET_RD_MMFR(base)       (ENET_MMFR_REG(base))
#define ENET_WR_MMFR(base, value) (ENET_MMFR_REG(base) = (value))
#define ENET_RMW_MMFR(base, mask, value) (ENET_WR_MMFR(base, (ENET_RD_MMFR(base) & ~(mask)) | (value)))
#define ENET_SET_MMFR(base, value) (ENET_WR_MMFR(base, ENET_RD_MMFR(base) |  (value)))
#define ENET_CLR_MMFR(base, value) (ENET_WR_MMFR(base, ENET_RD_MMFR(base) & ~(value)))
#define ENET_TOG_MMFR(base, value) (ENET_WR_MMFR(base, ENET_RD_MMFR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_MMFR bitfields
 */

/*!
 * @name Register ENET_MMFR, field DATA[15:0] (RW)
 *
 * This is the field for data to be written to or read from the PHY register.
 */
/*@{*/
/*! @brief Read current value of the ENET_MMFR_DATA field. */
#define ENET_RD_MMFR_DATA(base) ((ENET_MMFR_REG(base) & ENET_MMFR_DATA_MASK) >> ENET_MMFR_DATA_SHIFT)
#define ENET_BRD_MMFR_DATA(base) (ENET_RD_MMFR_DATA(base))

/*! @brief Set the DATA field to a new value. */
#define ENET_WR_MMFR_DATA(base, value) (ENET_RMW_MMFR(base, ENET_MMFR_DATA_MASK, ENET_MMFR_DATA(value)))
#define ENET_BWR_MMFR_DATA(base, value) (ENET_WR_MMFR_DATA(base, value))
/*@}*/

/*!
 * @name Register ENET_MMFR, field TA[17:16] (RW)
 *
 * This field must be programmed to 10 to generate a valid MII management frame.
 */
/*@{*/
/*! @brief Read current value of the ENET_MMFR_TA field. */
#define ENET_RD_MMFR_TA(base) ((ENET_MMFR_REG(base) & ENET_MMFR_TA_MASK) >> ENET_MMFR_TA_SHIFT)
#define ENET_BRD_MMFR_TA(base) (ENET_RD_MMFR_TA(base))

/*! @brief Set the TA field to a new value. */
#define ENET_WR_MMFR_TA(base, value) (ENET_RMW_MMFR(base, ENET_MMFR_TA_MASK, ENET_MMFR_TA(value)))
#define ENET_BWR_MMFR_TA(base, value) (ENET_WR_MMFR_TA(base, value))
/*@}*/

/*!
 * @name Register ENET_MMFR, field RA[22:18] (RW)
 *
 * Specifies one of up to 32 registers within the specified PHY device.
 */
/*@{*/
/*! @brief Read current value of the ENET_MMFR_RA field. */
#define ENET_RD_MMFR_RA(base) ((ENET_MMFR_REG(base) & ENET_MMFR_RA_MASK) >> ENET_MMFR_RA_SHIFT)
#define ENET_BRD_MMFR_RA(base) (ENET_RD_MMFR_RA(base))

/*! @brief Set the RA field to a new value. */
#define ENET_WR_MMFR_RA(base, value) (ENET_RMW_MMFR(base, ENET_MMFR_RA_MASK, ENET_MMFR_RA(value)))
#define ENET_BWR_MMFR_RA(base, value) (ENET_WR_MMFR_RA(base, value))
/*@}*/

/*!
 * @name Register ENET_MMFR, field PA[27:23] (RW)
 *
 * Specifies one of up to 32 attached PHY devices.
 */
/*@{*/
/*! @brief Read current value of the ENET_MMFR_PA field. */
#define ENET_RD_MMFR_PA(base) ((ENET_MMFR_REG(base) & ENET_MMFR_PA_MASK) >> ENET_MMFR_PA_SHIFT)
#define ENET_BRD_MMFR_PA(base) (ENET_RD_MMFR_PA(base))

/*! @brief Set the PA field to a new value. */
#define ENET_WR_MMFR_PA(base, value) (ENET_RMW_MMFR(base, ENET_MMFR_PA_MASK, ENET_MMFR_PA(value)))
#define ENET_BWR_MMFR_PA(base, value) (ENET_WR_MMFR_PA(base, value))
/*@}*/

/*!
 * @name Register ENET_MMFR, field OP[29:28] (RW)
 *
 * Determines the frame operation.
 *
 * Values:
 * - 0b00 - Write frame operation, but not MII compliant.
 * - 0b01 - Write frame operation for a valid MII management frame.
 * - 0b10 - Read frame operation for a valid MII management frame.
 * - 0b11 - Read frame operation, but not MII compliant.
 */
/*@{*/
/*! @brief Read current value of the ENET_MMFR_OP field. */
#define ENET_RD_MMFR_OP(base) ((ENET_MMFR_REG(base) & ENET_MMFR_OP_MASK) >> ENET_MMFR_OP_SHIFT)
#define ENET_BRD_MMFR_OP(base) (ENET_RD_MMFR_OP(base))

/*! @brief Set the OP field to a new value. */
#define ENET_WR_MMFR_OP(base, value) (ENET_RMW_MMFR(base, ENET_MMFR_OP_MASK, ENET_MMFR_OP(value)))
#define ENET_BWR_MMFR_OP(base, value) (ENET_WR_MMFR_OP(base, value))
/*@}*/

/*!
 * @name Register ENET_MMFR, field ST[31:30] (RW)
 *
 * These fields must be programmed to 01 for a valid MII management frame.
 */
/*@{*/
/*! @brief Read current value of the ENET_MMFR_ST field. */
#define ENET_RD_MMFR_ST(base) ((ENET_MMFR_REG(base) & ENET_MMFR_ST_MASK) >> ENET_MMFR_ST_SHIFT)
#define ENET_BRD_MMFR_ST(base) (ENET_RD_MMFR_ST(base))

/*! @brief Set the ST field to a new value. */
#define ENET_WR_MMFR_ST(base, value) (ENET_RMW_MMFR(base, ENET_MMFR_ST_MASK, ENET_MMFR_ST(value)))
#define ENET_BWR_MMFR_ST(base, value) (ENET_WR_MMFR_ST(base, value))
/*@}*/

/*******************************************************************************
 * ENET_MSCR - MII Speed Control Register
 ******************************************************************************/

/*!
 * @brief ENET_MSCR - MII Speed Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * MSCR provides control of the MII clock (MDC pin) frequency and allows a
 * preamble drop on the MII management frame. The MII_SPEED field must be programmed
 * with a value to provide an MDC frequency of less than or equal to 2.5 MHz to be
 * compliant with the IEEE 802.3 MII specification. The MII_SPEED must be set to
 * a non-zero value to source a read or write management frame. After the
 * management frame is complete, the MSCR register may optionally be cleared to turn
 * off MDC. The MDC signal generated has a 50% duty cycle except when MII_SPEED
 * changes during operation. This change takes effect following a rising or falling
 * edge of MDC. If the internal module clock is 25 MHz, programming this register
 * to 0x0000_0004 results in an MDC as stated in the following equation: 25 MHz
 * / ((4 + 1) x 2) = 2.5 MHz The following table shows the optimum values for
 * MII_SPEED as a function of internal module clock frequency. Programming Examples
 * for MSCR Internal MAC clock frequency MSCR [MII_SPEED] MDC frequency 25 MHz
 * 0x4 2.50 MHz 33 MHz 0x6 2.36 MHz 40 MHz 0x7 2.50 MHz 50 MHz 0x9 2.50 MHz 66 MHz
 * 0xD 2.36 MHz
 */
/*!
 * @name Constants and macros for entire ENET_MSCR register
 */
/*@{*/
#define ENET_RD_MSCR(base)       (ENET_MSCR_REG(base))
#define ENET_WR_MSCR(base, value) (ENET_MSCR_REG(base) = (value))
#define ENET_RMW_MSCR(base, mask, value) (ENET_WR_MSCR(base, (ENET_RD_MSCR(base) & ~(mask)) | (value)))
#define ENET_SET_MSCR(base, value) (ENET_WR_MSCR(base, ENET_RD_MSCR(base) |  (value)))
#define ENET_CLR_MSCR(base, value) (ENET_WR_MSCR(base, ENET_RD_MSCR(base) & ~(value)))
#define ENET_TOG_MSCR(base, value) (ENET_WR_MSCR(base, ENET_RD_MSCR(base) ^  (value)))
/*@}*/

