RT-Thread/rt-thread/bsp/freescale/platform/devices/MK52D10/include/MK52D10_extension.h
/*! @brief Set the PADEN field to a new value. */
#define ENET_WR_RCR_PADEN(base, value) (ENET_RMW_RCR(base, ENET_RCR_PADEN_MASK, ENET_RCR_PADEN(value)))
#define ENET_BWR_RCR_PADEN(base, value) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_PADEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_RCR, field PAUFWD[13] (RW)
 *
 * Specifies whether pause frames are terminated or forwarded.
 *
 * Values:
 * - 0b0 - Pause frames are terminated and discarded in the MAC.
 * - 0b1 - Pause frames are forwarded to the user application.
 */
/*@{*/
/*! @brief Read current value of the ENET_RCR_PAUFWD field. */
#define ENET_RD_RCR_PAUFWD(base) ((ENET_RCR_REG(base) & ENET_RCR_PAUFWD_MASK) >> ENET_RCR_PAUFWD_SHIFT)
#define ENET_BRD_RCR_PAUFWD(base) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_PAUFWD_SHIFT))

/*! @brief Set the PAUFWD field to a new value. */
#define ENET_WR_RCR_PAUFWD(base, value) (ENET_RMW_RCR(base, ENET_RCR_PAUFWD_MASK, ENET_RCR_PAUFWD(value)))
#define ENET_BWR_RCR_PAUFWD(base, value) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_PAUFWD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_RCR, field CRCFWD[14] (RW)
 *
 * Specifies whether the CRC field of received frames is transmitted or
 * stripped. If padding function is enabled (PADEN = 1), CRCFWD is ignored and the CRC
 * field is checked and always terminated and removed.
 *
 * Values:
 * - 0b0 - The CRC field of received frames is transmitted to the user
 *     application.
 * - 0b1 - The CRC field is stripped from the frame.
 */
/*@{*/
/*! @brief Read current value of the ENET_RCR_CRCFWD field. */
#define ENET_RD_RCR_CRCFWD(base) ((ENET_RCR_REG(base) & ENET_RCR_CRCFWD_MASK) >> ENET_RCR_CRCFWD_SHIFT)
#define ENET_BRD_RCR_CRCFWD(base) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_CRCFWD_SHIFT))

/*! @brief Set the CRCFWD field to a new value. */
#define ENET_WR_RCR_CRCFWD(base, value) (ENET_RMW_RCR(base, ENET_RCR_CRCFWD_MASK, ENET_RCR_CRCFWD(value)))
#define ENET_BWR_RCR_CRCFWD(base, value) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_CRCFWD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_RCR, field CFEN[15] (RW)
 *
 * Enables/disables the MAC control frame.
 *
 * Values:
 * - 0b0 - MAC control frames with any opcode other than 0x0001 (pause frame)
 *     are accepted and forwarded to the client interface.
 * - 0b1 - MAC control frames with any opcode other than 0x0001 (pause frame)
 *     are silently discarded.
 */
/*@{*/
/*! @brief Read current value of the ENET_RCR_CFEN field. */
#define ENET_RD_RCR_CFEN(base) ((ENET_RCR_REG(base) & ENET_RCR_CFEN_MASK) >> ENET_RCR_CFEN_SHIFT)
#define ENET_BRD_RCR_CFEN(base) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_CFEN_SHIFT))

/*! @brief Set the CFEN field to a new value. */
#define ENET_WR_RCR_CFEN(base, value) (ENET_RMW_RCR(base, ENET_RCR_CFEN_MASK, ENET_RCR_CFEN(value)))
#define ENET_BWR_RCR_CFEN(base, value) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_CFEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_RCR, field MAX_FL[29:16] (RW)
 *
 * Resets to decimal 1518. Length is measured starting at DA and includes the
 * CRC at the end of the frame. Transmit frames longer than MAX_FL cause the BABT
 * interrupt to occur. Receive frames longer than MAX_FL cause the BABR interrupt
 * to occur and set the LG field in the end of frame receive buffer descriptor.
 * The recommended default value to be programmed is 1518 or 1522 if VLAN tags are
 * supported.
 */
/*@{*/
/*! @brief Read current value of the ENET_RCR_MAX_FL field. */
#define ENET_RD_RCR_MAX_FL(base) ((ENET_RCR_REG(base) & ENET_RCR_MAX_FL_MASK) >> ENET_RCR_MAX_FL_SHIFT)
#define ENET_BRD_RCR_MAX_FL(base) (ENET_RD_RCR_MAX_FL(base))

/*! @brief Set the MAX_FL field to a new value. */
#define ENET_WR_RCR_MAX_FL(base, value) (ENET_RMW_RCR(base, ENET_RCR_MAX_FL_MASK, ENET_RCR_MAX_FL(value)))
#define ENET_BWR_RCR_MAX_FL(base, value) (ENET_WR_RCR_MAX_FL(base, value))
/*@}*/

/*!
 * @name Register ENET_RCR, field NLC[30] (RW)
 *
 * Enables/disables a payload length check.
 *
 * Values:
 * - 0b0 - The payload length check is disabled.
 * - 0b1 - The core checks the frame's payload length with the frame length/type
 *     field. Errors are indicated in the EIR[PLC] field.
 */
/*@{*/
/*! @brief Read current value of the ENET_RCR_NLC field. */
#define ENET_RD_RCR_NLC(base) ((ENET_RCR_REG(base) & ENET_RCR_NLC_MASK) >> ENET_RCR_NLC_SHIFT)
#define ENET_BRD_RCR_NLC(base) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_NLC_SHIFT))

/*! @brief Set the NLC field to a new value. */
#define ENET_WR_RCR_NLC(base, value) (ENET_RMW_RCR(base, ENET_RCR_NLC_MASK, ENET_RCR_NLC(value)))
#define ENET_BWR_RCR_NLC(base, value) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_NLC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_RCR, field GRS[31] (RO)
 *
 * Read-only status indicating that the MAC receive datapath is stopped.
 */
/*@{*/
/*! @brief Read current value of the ENET_RCR_GRS field. */
#define ENET_RD_RCR_GRS(base) ((ENET_RCR_REG(base) & ENET_RCR_GRS_MASK) >> ENET_RCR_GRS_SHIFT)
#define ENET_BRD_RCR_GRS(base) (BITBAND_ACCESS32(&ENET_RCR_REG(base), ENET_RCR_GRS_SHIFT))
/*@}*/

/*******************************************************************************
 * ENET_TCR - Transmit Control Register
 ******************************************************************************/

/*!
 * @brief ENET_TCR - Transmit Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TCR is read/write and configures the transmit block. This register is cleared
 * at system reset. FDEN can only be modified when ECR[ETHER_EN] is cleared.
 */
/*!
 * @name Constants and macros for entire ENET_TCR register
 */
/*@{*/
#define ENET_RD_TCR(base)        (ENET_TCR_REG(base))
#define ENET_WR_TCR(base, value) (ENET_TCR_REG(base) = (value))
#define ENET_RMW_TCR(base, mask, value) (ENET_WR_TCR(base, (ENET_RD_TCR(base) & ~(mask)) | (value)))
#define ENET_SET_TCR(base, value) (ENET_WR_TCR(base, ENET_RD_TCR(base) |  (value)))
#define ENET_CLR_TCR(base, value) (ENET_WR_TCR(base, ENET_RD_TCR(base) & ~(value)))
#define ENET_TOG_TCR(base, value) (ENET_WR_TCR(base, ENET_RD_TCR(base) ^  (value)))
/*@}*/

