RT-Thread/rt-thread/bsp/freescale/platform/devices/MK52D10/include/MK52D10_extension.h
/*
 * Constants & macros for individual ENET_MRBR bitfields
 */

/*!
 * @name Register ENET_MRBR, field R_BUF_SIZE[13:4] (RW)
 *
 * Receive buffer size in bytes.
 */
/*@{*/
/*! @brief Read current value of the ENET_MRBR_R_BUF_SIZE field. */
#define ENET_RD_MRBR_R_BUF_SIZE(base) ((ENET_MRBR_REG(base) & ENET_MRBR_R_BUF_SIZE_MASK) >> ENET_MRBR_R_BUF_SIZE_SHIFT)
#define ENET_BRD_MRBR_R_BUF_SIZE(base) (ENET_RD_MRBR_R_BUF_SIZE(base))

/*! @brief Set the R_BUF_SIZE field to a new value. */
#define ENET_WR_MRBR_R_BUF_SIZE(base, value) (ENET_RMW_MRBR(base, ENET_MRBR_R_BUF_SIZE_MASK, ENET_MRBR_R_BUF_SIZE(value)))
#define ENET_BWR_MRBR_R_BUF_SIZE(base, value) (ENET_WR_MRBR_R_BUF_SIZE(base, value))
/*@}*/

/*******************************************************************************
 * ENET_RSFL - Receive FIFO Section Full Threshold
 ******************************************************************************/

/*!
 * @brief ENET_RSFL - Receive FIFO Section Full Threshold (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RSFL register
 */
/*@{*/
#define ENET_RD_RSFL(base)       (ENET_RSFL_REG(base))
#define ENET_WR_RSFL(base, value) (ENET_RSFL_REG(base) = (value))
#define ENET_RMW_RSFL(base, mask, value) (ENET_WR_RSFL(base, (ENET_RD_RSFL(base) & ~(mask)) | (value)))
#define ENET_SET_RSFL(base, value) (ENET_WR_RSFL(base, ENET_RD_RSFL(base) |  (value)))
#define ENET_CLR_RSFL(base, value) (ENET_WR_RSFL(base, ENET_RD_RSFL(base) & ~(value)))
#define ENET_TOG_RSFL(base, value) (ENET_WR_RSFL(base, ENET_RD_RSFL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RSFL bitfields
 */

/*!
 * @name Register ENET_RSFL, field RX_SECTION_FULL[7:0] (RW)
 *
 * Value, in 64-bit words, of the receive FIFO section full threshold. Clear
 * this field to enable store and forward on the RX FIFO. When programming a value
 * greater than 0 (cut-through operation), it must be greater than
 * RAEM[RX_ALMOST_EMPTY].
 */
/*@{*/
/*! @brief Read current value of the ENET_RSFL_RX_SECTION_FULL field. */
#define ENET_RD_RSFL_RX_SECTION_FULL(base) ((ENET_RSFL_REG(base) & ENET_RSFL_RX_SECTION_FULL_MASK) >> ENET_RSFL_RX_SECTION_FULL_SHIFT)
#define ENET_BRD_RSFL_RX_SECTION_FULL(base) (ENET_RD_RSFL_RX_SECTION_FULL(base))

/*! @brief Set the RX_SECTION_FULL field to a new value. */
#define ENET_WR_RSFL_RX_SECTION_FULL(base, value) (ENET_RMW_RSFL(base, ENET_RSFL_RX_SECTION_FULL_MASK, ENET_RSFL_RX_SECTION_FULL(value)))
#define ENET_BWR_RSFL_RX_SECTION_FULL(base, value) (ENET_WR_RSFL_RX_SECTION_FULL(base, value))
/*@}*/

/*******************************************************************************
 * ENET_RSEM - Receive FIFO Section Empty Threshold
 ******************************************************************************/

/*!
 * @brief ENET_RSEM - Receive FIFO Section Empty Threshold (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RSEM register
 */
/*@{*/
#define ENET_RD_RSEM(base)       (ENET_RSEM_REG(base))
#define ENET_WR_RSEM(base, value) (ENET_RSEM_REG(base) = (value))
#define ENET_RMW_RSEM(base, mask, value) (ENET_WR_RSEM(base, (ENET_RD_RSEM(base) & ~(mask)) | (value)))
#define ENET_SET_RSEM(base, value) (ENET_WR_RSEM(base, ENET_RD_RSEM(base) |  (value)))
#define ENET_CLR_RSEM(base, value) (ENET_WR_RSEM(base, ENET_RD_RSEM(base) & ~(value)))
#define ENET_TOG_RSEM(base, value) (ENET_WR_RSEM(base, ENET_RD_RSEM(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RSEM bitfields
 */

/*!
 * @name Register ENET_RSEM, field RX_SECTION_EMPTY[7:0] (RW)
 *
 * Value, in 64-bit words, of the receive FIFO section empty threshold.
 */
/*@{*/
/*! @brief Read current value of the ENET_RSEM_RX_SECTION_EMPTY field. */
#define ENET_RD_RSEM_RX_SECTION_EMPTY(base) ((ENET_RSEM_REG(base) & ENET_RSEM_RX_SECTION_EMPTY_MASK) >> ENET_RSEM_RX_SECTION_EMPTY_SHIFT)
#define ENET_BRD_RSEM_RX_SECTION_EMPTY(base) (ENET_RD_RSEM_RX_SECTION_EMPTY(base))

/*! @brief Set the RX_SECTION_EMPTY field to a new value. */
#define ENET_WR_RSEM_RX_SECTION_EMPTY(base, value) (ENET_RMW_RSEM(base, ENET_RSEM_RX_SECTION_EMPTY_MASK, ENET_RSEM_RX_SECTION_EMPTY(value)))
#define ENET_BWR_RSEM_RX_SECTION_EMPTY(base, value) (ENET_WR_RSEM_RX_SECTION_EMPTY(base, value))
/*@}*/

/*******************************************************************************
 * ENET_RAEM - Receive FIFO Almost Empty Threshold
 ******************************************************************************/

/*!
 * @brief ENET_RAEM - Receive FIFO Almost Empty Threshold (RW)
 *
 * Reset value: 0x00000004U
 */
/*!
 * @name Constants and macros for entire ENET_RAEM register
 */
/*@{*/
#define ENET_RD_RAEM(base)       (ENET_RAEM_REG(base))
#define ENET_WR_RAEM(base, value) (ENET_RAEM_REG(base) = (value))
#define ENET_RMW_RAEM(base, mask, value) (ENET_WR_RAEM(base, (ENET_RD_RAEM(base) & ~(mask)) | (value)))
#define ENET_SET_RAEM(base, value) (ENET_WR_RAEM(base, ENET_RD_RAEM(base) |  (value)))
#define ENET_CLR_RAEM(base, value) (ENET_WR_RAEM(base, ENET_RD_RAEM(base) & ~(value)))
#define ENET_TOG_RAEM(base, value) (ENET_WR_RAEM(base, ENET_RD_RAEM(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RAEM bitfields
 */

/*!
 * @name Register ENET_RAEM, field RX_ALMOST_EMPTY[7:0] (RW)
 *
 * Value, in 64-bit words, of the receive FIFO almost empty threshold.
 */
/*@{*/
/*! @brief Read current value of the ENET_RAEM_RX_ALMOST_EMPTY field. */
#define ENET_RD_RAEM_RX_ALMOST_EMPTY(base) ((ENET_RAEM_REG(base) & ENET_RAEM_RX_ALMOST_EMPTY_MASK) >> ENET_RAEM_RX_ALMOST_EMPTY_SHIFT)
#define ENET_BRD_RAEM_RX_ALMOST_EMPTY(base) (ENET_RD_RAEM_RX_ALMOST_EMPTY(base))

/*! @brief Set the RX_ALMOST_EMPTY field to a new value. */
#define ENET_WR_RAEM_RX_ALMOST_EMPTY(base, value) (ENET_RMW_RAEM(base, ENET_RAEM_RX_ALMOST_EMPTY_MASK, ENET_RAEM_RX_ALMOST_EMPTY(value)))
#define ENET_BWR_RAEM_RX_ALMOST_EMPTY(base, value) (ENET_WR_RAEM_RX_ALMOST_EMPTY(base, value))
/*@}*/

/*******************************************************************************
 * ENET_RAFL - Receive FIFO Almost Full Threshold
 ******************************************************************************/

/*!
 * @brief ENET_RAFL - Receive FIFO Almost Full Threshold (RW)
 *
 * Reset value: 0x00000004U
 */
/*!
 * @name Constants and macros for entire ENET_RAFL register
 */
/*@{*/
#define ENET_RD_RAFL(base)       (ENET_RAFL_REG(base))
#define ENET_WR_RAFL(base, value) (ENET_RAFL_REG(base) = (value))
#define ENET_RMW_RAFL(base, mask, value) (ENET_WR_RAFL(base, (ENET_RD_RAFL(base) & ~(mask)) | (value)))
#define ENET_SET_RAFL(base, value) (ENET_WR_RAFL(base, ENET_RD_RAFL(base) |  (value)))
#define ENET_CLR_RAFL(base, value) (ENET_WR_RAFL(base, ENET_RD_RAFL(base) & ~(value)))
#define ENET_TOG_RAFL(base, value) (ENET_WR_RAFL(base, ENET_RD_RAFL(base) ^  (value)))
/*@}*/

