RT-Thread/rt-thread/bsp/freescale/platform/devices/MK52D10/include/MK52D10_extension.h
/*
 * Constants & macros for individual ENET_IEEE_T_MCOL bitfields
 */

/*!
 * @name Register ENET_IEEE_T_MCOL, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_IEEE_T_MCOL_COUNT field. */
#define ENET_RD_IEEE_T_MCOL_COUNT(base) ((ENET_IEEE_T_MCOL_REG(base) & ENET_IEEE_T_MCOL_COUNT_MASK) >> ENET_IEEE_T_MCOL_COUNT_SHIFT)
#define ENET_BRD_IEEE_T_MCOL_COUNT(base) (ENET_RD_IEEE_T_MCOL_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_IEEE_T_DEF - Frames Transmitted after Deferral Delay (IEEE_T_DEF)
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_T_DEF - Frames Transmitted after Deferral Delay (IEEE_T_DEF) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_T_DEF register
 */
/*@{*/
#define ENET_RD_IEEE_T_DEF(base) (ENET_IEEE_T_DEF_REG(base))
#define ENET_WR_IEEE_T_DEF(base, value) (ENET_IEEE_T_DEF_REG(base) = (value))
#define ENET_RMW_IEEE_T_DEF(base, mask, value) (ENET_WR_IEEE_T_DEF(base, (ENET_RD_IEEE_T_DEF(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_T_DEF(base, value) (ENET_WR_IEEE_T_DEF(base, ENET_RD_IEEE_T_DEF(base) |  (value)))
#define ENET_CLR_IEEE_T_DEF(base, value) (ENET_WR_IEEE_T_DEF(base, ENET_RD_IEEE_T_DEF(base) & ~(value)))
#define ENET_TOG_IEEE_T_DEF(base, value) (ENET_WR_IEEE_T_DEF(base, ENET_RD_IEEE_T_DEF(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_T_DEF bitfields
 */

/*!
 * @name Register ENET_IEEE_T_DEF, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_IEEE_T_DEF_COUNT field. */
#define ENET_RD_IEEE_T_DEF_COUNT(base) ((ENET_IEEE_T_DEF_REG(base) & ENET_IEEE_T_DEF_COUNT_MASK) >> ENET_IEEE_T_DEF_COUNT_SHIFT)
#define ENET_BRD_IEEE_T_DEF_COUNT(base) (ENET_RD_IEEE_T_DEF_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_IEEE_T_LCOL - Frames Transmitted with Late Collision (IEEE_T_LCOL)
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_T_LCOL - Frames Transmitted with Late Collision (IEEE_T_LCOL) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_T_LCOL register
 */
/*@{*/
#define ENET_RD_IEEE_T_LCOL(base) (ENET_IEEE_T_LCOL_REG(base))
#define ENET_WR_IEEE_T_LCOL(base, value) (ENET_IEEE_T_LCOL_REG(base) = (value))
#define ENET_RMW_IEEE_T_LCOL(base, mask, value) (ENET_WR_IEEE_T_LCOL(base, (ENET_RD_IEEE_T_LCOL(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_T_LCOL(base, value) (ENET_WR_IEEE_T_LCOL(base, ENET_RD_IEEE_T_LCOL(base) |  (value)))
#define ENET_CLR_IEEE_T_LCOL(base, value) (ENET_WR_IEEE_T_LCOL(base, ENET_RD_IEEE_T_LCOL(base) & ~(value)))
#define ENET_TOG_IEEE_T_LCOL(base, value) (ENET_WR_IEEE_T_LCOL(base, ENET_RD_IEEE_T_LCOL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_T_LCOL bitfields
 */

/*!
 * @name Register ENET_IEEE_T_LCOL, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_IEEE_T_LCOL_COUNT field. */
#define ENET_RD_IEEE_T_LCOL_COUNT(base) ((ENET_IEEE_T_LCOL_REG(base) & ENET_IEEE_T_LCOL_COUNT_MASK) >> ENET_IEEE_T_LCOL_COUNT_SHIFT)
#define ENET_BRD_IEEE_T_LCOL_COUNT(base) (ENET_RD_IEEE_T_LCOL_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_IEEE_T_EXCOL - Frames Transmitted with Excessive Collisions (IEEE_T_EXCOL)
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_T_EXCOL - Frames Transmitted with Excessive Collisions (IEEE_T_EXCOL) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_T_EXCOL register
 */
/*@{*/
#define ENET_RD_IEEE_T_EXCOL(base) (ENET_IEEE_T_EXCOL_REG(base))
#define ENET_WR_IEEE_T_EXCOL(base, value) (ENET_IEEE_T_EXCOL_REG(base) = (value))
#define ENET_RMW_IEEE_T_EXCOL(base, mask, value) (ENET_WR_IEEE_T_EXCOL(base, (ENET_RD_IEEE_T_EXCOL(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_T_EXCOL(base, value) (ENET_WR_IEEE_T_EXCOL(base, ENET_RD_IEEE_T_EXCOL(base) |  (value)))
#define ENET_CLR_IEEE_T_EXCOL(base, value) (ENET_WR_IEEE_T_EXCOL(base, ENET_RD_IEEE_T_EXCOL(base) & ~(value)))
#define ENET_TOG_IEEE_T_EXCOL(base, value) (ENET_WR_IEEE_T_EXCOL(base, ENET_RD_IEEE_T_EXCOL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_T_EXCOL bitfields
 */

/*!
 * @name Register ENET_IEEE_T_EXCOL, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_IEEE_T_EXCOL_COUNT field. */
#define ENET_RD_IEEE_T_EXCOL_COUNT(base) ((ENET_IEEE_T_EXCOL_REG(base) & ENET_IEEE_T_EXCOL_COUNT_MASK) >> ENET_IEEE_T_EXCOL_COUNT_SHIFT)
#define ENET_BRD_IEEE_T_EXCOL_COUNT(base) (ENET_RD_IEEE_T_EXCOL_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_IEEE_T_MACERR - Frames Transmitted with Tx FIFO Underrun (IEEE_T_MACERR)
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_T_MACERR - Frames Transmitted with Tx FIFO Underrun (IEEE_T_MACERR) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_T_MACERR register
 */
/*@{*/
#define ENET_RD_IEEE_T_MACERR(base) (ENET_IEEE_T_MACERR_REG(base))
#define ENET_WR_IEEE_T_MACERR(base, value) (ENET_IEEE_T_MACERR_REG(base) = (value))
#define ENET_RMW_IEEE_T_MACERR(base, mask, value) (ENET_WR_IEEE_T_MACERR(base, (ENET_RD_IEEE_T_MACERR(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_T_MACERR(base, value) (ENET_WR_IEEE_T_MACERR(base, ENET_RD_IEEE_T_MACERR(base) |  (value)))
#define ENET_CLR_IEEE_T_MACERR(base, value) (ENET_WR_IEEE_T_MACERR(base, ENET_RD_IEEE_T_MACERR(base) & ~(value)))
#define ENET_TOG_IEEE_T_MACERR(base, value) (ENET_WR_IEEE_T_MACERR(base, ENET_RD_IEEE_T_MACERR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_T_MACERR bitfields
 */

/*!
 * @name Register ENET_IEEE_T_MACERR, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_IEEE_T_MACERR_COUNT field. */
#define ENET_RD_IEEE_T_MACERR_COUNT(base) ((ENET_IEEE_T_MACERR_REG(base) & ENET_IEEE_T_MACERR_COUNT_MASK) >> ENET_IEEE_T_MACERR_COUNT_SHIFT)
#define ENET_BRD_IEEE_T_MACERR_COUNT(base) (ENET_RD_IEEE_T_MACERR_COUNT(base))
/*@}*/

