RT-Thread/rt-thread/bsp/freescale/platform/devices/MK52D10/include/MK52D10_extension.h
/*******************************************************************************
 * ENET_RMON_R_BC_PKT - RMON Rx Broadcast Packets (RMON_R_BC_PKT)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_BC_PKT - RMON Rx Broadcast Packets (RMON_R_BC_PKT) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_BC_PKT register
 */
/*@{*/
#define ENET_RD_RMON_R_BC_PKT(base) (ENET_RMON_R_BC_PKT_REG(base))
#define ENET_WR_RMON_R_BC_PKT(base, value) (ENET_RMON_R_BC_PKT_REG(base) = (value))
#define ENET_RMW_RMON_R_BC_PKT(base, mask, value) (ENET_WR_RMON_R_BC_PKT(base, (ENET_RD_RMON_R_BC_PKT(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_R_BC_PKT(base, value) (ENET_WR_RMON_R_BC_PKT(base, ENET_RD_RMON_R_BC_PKT(base) |  (value)))
#define ENET_CLR_RMON_R_BC_PKT(base, value) (ENET_WR_RMON_R_BC_PKT(base, ENET_RD_RMON_R_BC_PKT(base) & ~(value)))
#define ENET_TOG_RMON_R_BC_PKT(base, value) (ENET_WR_RMON_R_BC_PKT(base, ENET_RD_RMON_R_BC_PKT(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_BC_PKT bitfields
 */

/*!
 * @name Register ENET_RMON_R_BC_PKT, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_R_BC_PKT_COUNT field. */
#define ENET_RD_RMON_R_BC_PKT_COUNT(base) ((ENET_RMON_R_BC_PKT_REG(base) & ENET_RMON_R_BC_PKT_COUNT_MASK) >> ENET_RMON_R_BC_PKT_COUNT_SHIFT)
#define ENET_BRD_RMON_R_BC_PKT_COUNT(base) (ENET_RD_RMON_R_BC_PKT_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_R_MC_PKT - RMON Rx Multicast Packets (RMON_R_MC_PKT)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_MC_PKT - RMON Rx Multicast Packets (RMON_R_MC_PKT) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_MC_PKT register
 */
/*@{*/
#define ENET_RD_RMON_R_MC_PKT(base) (ENET_RMON_R_MC_PKT_REG(base))
#define ENET_WR_RMON_R_MC_PKT(base, value) (ENET_RMON_R_MC_PKT_REG(base) = (value))
#define ENET_RMW_RMON_R_MC_PKT(base, mask, value) (ENET_WR_RMON_R_MC_PKT(base, (ENET_RD_RMON_R_MC_PKT(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_R_MC_PKT(base, value) (ENET_WR_RMON_R_MC_PKT(base, ENET_RD_RMON_R_MC_PKT(base) |  (value)))
#define ENET_CLR_RMON_R_MC_PKT(base, value) (ENET_WR_RMON_R_MC_PKT(base, ENET_RD_RMON_R_MC_PKT(base) & ~(value)))
#define ENET_TOG_RMON_R_MC_PKT(base, value) (ENET_WR_RMON_R_MC_PKT(base, ENET_RD_RMON_R_MC_PKT(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_MC_PKT bitfields
 */

/*!
 * @name Register ENET_RMON_R_MC_PKT, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_R_MC_PKT_COUNT field. */
#define ENET_RD_RMON_R_MC_PKT_COUNT(base) ((ENET_RMON_R_MC_PKT_REG(base) & ENET_RMON_R_MC_PKT_COUNT_MASK) >> ENET_RMON_R_MC_PKT_COUNT_SHIFT)
#define ENET_BRD_RMON_R_MC_PKT_COUNT(base) (ENET_RD_RMON_R_MC_PKT_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_R_CRC_ALIGN - RMON Rx Packets w CRC/Align error (RMON_R_CRC_ALIGN)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_CRC_ALIGN - RMON Rx Packets w CRC/Align error (RMON_R_CRC_ALIGN) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_CRC_ALIGN register
 */
/*@{*/
#define ENET_RD_RMON_R_CRC_ALIGN(base) (ENET_RMON_R_CRC_ALIGN_REG(base))
#define ENET_WR_RMON_R_CRC_ALIGN(base, value) (ENET_RMON_R_CRC_ALIGN_REG(base) = (value))
#define ENET_RMW_RMON_R_CRC_ALIGN(base, mask, value) (ENET_WR_RMON_R_CRC_ALIGN(base, (ENET_RD_RMON_R_CRC_ALIGN(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_R_CRC_ALIGN(base, value) (ENET_WR_RMON_R_CRC_ALIGN(base, ENET_RD_RMON_R_CRC_ALIGN(base) |  (value)))
#define ENET_CLR_RMON_R_CRC_ALIGN(base, value) (ENET_WR_RMON_R_CRC_ALIGN(base, ENET_RD_RMON_R_CRC_ALIGN(base) & ~(value)))
#define ENET_TOG_RMON_R_CRC_ALIGN(base, value) (ENET_WR_RMON_R_CRC_ALIGN(base, ENET_RD_RMON_R_CRC_ALIGN(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_CRC_ALIGN bitfields
 */

/*!
 * @name Register ENET_RMON_R_CRC_ALIGN, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_R_CRC_ALIGN_COUNT field. */
#define ENET_RD_RMON_R_CRC_ALIGN_COUNT(base) ((ENET_RMON_R_CRC_ALIGN_REG(base) & ENET_RMON_R_CRC_ALIGN_COUNT_MASK) >> ENET_RMON_R_CRC_ALIGN_COUNT_SHIFT)
#define ENET_BRD_RMON_R_CRC_ALIGN_COUNT(base) (ENET_RD_RMON_R_CRC_ALIGN_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_R_UNDERSIZE - RMON Rx Packets < 64 bytes, good CRC (RMON_R_UNDERSIZE)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_UNDERSIZE - RMON Rx Packets < 64 bytes, good CRC (RMON_R_UNDERSIZE) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_UNDERSIZE register
 */
/*@{*/
#define ENET_RD_RMON_R_UNDERSIZE(base) (ENET_RMON_R_UNDERSIZE_REG(base))
#define ENET_WR_RMON_R_UNDERSIZE(base, value) (ENET_RMON_R_UNDERSIZE_REG(base) = (value))
#define ENET_RMW_RMON_R_UNDERSIZE(base, mask, value) (ENET_WR_RMON_R_UNDERSIZE(base, (ENET_RD_RMON_R_UNDERSIZE(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_R_UNDERSIZE(base, value) (ENET_WR_RMON_R_UNDERSIZE(base, ENET_RD_RMON_R_UNDERSIZE(base) |  (value)))
#define ENET_CLR_RMON_R_UNDERSIZE(base, value) (ENET_WR_RMON_R_UNDERSIZE(base, ENET_RD_RMON_R_UNDERSIZE(base) & ~(value)))
#define ENET_TOG_RMON_R_UNDERSIZE(base, value) (ENET_WR_RMON_R_UNDERSIZE(base, ENET_RD_RMON_R_UNDERSIZE(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_UNDERSIZE bitfields
 */

/*!
 * @name Register ENET_RMON_R_UNDERSIZE, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_R_UNDERSIZE_COUNT field. */
#define ENET_RD_RMON_R_UNDERSIZE_COUNT(base) ((ENET_RMON_R_UNDERSIZE_REG(base) & ENET_RMON_R_UNDERSIZE_COUNT_MASK) >> ENET_RMON_R_UNDERSIZE_COUNT_SHIFT)
#define ENET_BRD_RMON_R_UNDERSIZE_COUNT(base) (ENET_RD_RMON_R_UNDERSIZE_COUNT(base))
/*@}*/

