RT-Thread/rt-thread/bsp/freescale/platform/devices/MK52D10/include/MK52D10_extension.h
/*! @brief Set the WBEF field to a new value. */
#define UART_WR_S3_WBEF(base, value) (UART_RMW_S3(base, UART_S3_WBEF_MASK, UART_S3_WBEF(value)))
#define UART_BWR_S3_WBEF(base, value) (BITBAND_ACCESS8(&UART_S3_REG(base), UART_S3_WBEF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register UART_S3, field PEF[7] (RW)
 *
 * Indicates that the received preamble has an error. If the received preamble
 * length is greater than or less than the transmit preamble length, the preamble
 * error flag is asserted. This flag is cleared by writing 1.
 *
 * Values:
 * - 0b0 - Preamble is correct.
 * - 0b1 - Preamble has an error.
 */
/*@{*/
/*! @brief Read current value of the UART_S3_PEF field. */
#define UART_RD_S3_PEF(base) ((UART_S3_REG(base) & UART_S3_PEF_MASK) >> UART_S3_PEF_SHIFT)
#define UART_BRD_S3_PEF(base) (BITBAND_ACCESS8(&UART_S3_REG(base), UART_S3_PEF_SHIFT))

/*! @brief Set the PEF field to a new value. */
#define UART_WR_S3_PEF(base, value) (UART_RMW_S3(base, UART_S3_PEF_MASK, UART_S3_PEF(value)))
#define UART_BWR_S3_PEF(base, value) (BITBAND_ACCESS8(&UART_S3_REG(base), UART_S3_PEF_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * UART_S4 - UART CEA709.1-B Status Register
 ******************************************************************************/

/*!
 * @brief UART_S4 - UART CEA709.1-B Status Register (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_S4 register
 */
/*@{*/
#define UART_RD_S4(base)         (UART_S4_REG(base))
#define UART_WR_S4(base, value)  (UART_S4_REG(base) = (value))
#define UART_RMW_S4(base, mask, value) (UART_WR_S4(base, (UART_RD_S4(base) & ~(mask)) | (value)))
#define UART_SET_S4(base, value) (UART_WR_S4(base, UART_RD_S4(base) |  (value)))
#define UART_CLR_S4(base, value) (UART_WR_S4(base, UART_RD_S4(base) & ~(value)))
#define UART_TOG_S4(base, value) (UART_WR_S4(base, UART_RD_S4(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual UART_S4 bitfields
 */

/*!
 * @name Register UART_S4, field FE[0] (RW)
 *
 * Indicates that the received CEA709.1-B packet has finished at byte boundary.
 * This flag is cleared by writing 1.
 *
 * Values:
 * - 0b0 - Received packet is byte bound.
 * - 0b1 - Received packet is not byte bound.
 */
/*@{*/
/*! @brief Read current value of the UART_S4_FE field. */
#define UART_RD_S4_FE(base)  ((UART_S4_REG(base) & UART_S4_FE_MASK) >> UART_S4_FE_SHIFT)
#define UART_BRD_S4_FE(base) (BITBAND_ACCESS8(&UART_S4_REG(base), UART_S4_FE_SHIFT))

/*! @brief Set the FE field to a new value. */
#define UART_WR_S4_FE(base, value) (UART_RMW_S4(base, UART_S4_FE_MASK, UART_S4_FE(value)))
#define UART_BWR_S4_FE(base, value) (BITBAND_ACCESS8(&UART_S4_REG(base), UART_S4_FE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register UART_S4, field ILCV[1] (RW)
 *
 * Indicates that line code violation received is not proper. This flag is
 * cleared by writing 1.
 *
 * Values:
 * - 0b0 - Line code violation received is proper.
 * - 0b1 - Line code violation received is improper, that is, less than three
 *     bit periods.
 */
/*@{*/
/*! @brief Read current value of the UART_S4_ILCV field. */
#define UART_RD_S4_ILCV(base) ((UART_S4_REG(base) & UART_S4_ILCV_MASK) >> UART_S4_ILCV_SHIFT)
#define UART_BRD_S4_ILCV(base) (BITBAND_ACCESS8(&UART_S4_REG(base), UART_S4_ILCV_SHIFT))

/*! @brief Set the ILCV field to a new value. */
#define UART_WR_S4_ILCV(base, value) (UART_RMW_S4(base, UART_S4_ILCV_MASK, UART_S4_ILCV(value)))
#define UART_BWR_S4_ILCV(base, value) (BITBAND_ACCESS8(&UART_S4_REG(base), UART_S4_ILCV_SHIFT) = (value))
/*@}*/

/*!
 * @name Register UART_S4, field CDET[3:2] (RW)
 *
 * Indicates when the collision occurs during transmission. This flag is cleared
 * by writing 2'b11. If the collision flag is not cleared by software and a
 * valid collision pulse is detected during some other phase of transmission, then
 * collision flag continues to indicate the previous value.
 *
 * Values:
 * - 0b00 - No collision.
 * - 0b01 - Collision occurred during preamble.
 * - 0b10 - Collision occurred during data.
 * - 0b11 - Collision occurred during line code violation.
 */
/*@{*/
/*! @brief Read current value of the UART_S4_CDET field. */
#define UART_RD_S4_CDET(base) ((UART_S4_REG(base) & UART_S4_CDET_MASK) >> UART_S4_CDET_SHIFT)
#define UART_BRD_S4_CDET(base) (UART_RD_S4_CDET(base))

/*! @brief Set the CDET field to a new value. */
#define UART_WR_S4_CDET(base, value) (UART_RMW_S4(base, UART_S4_CDET_MASK, UART_S4_CDET(value)))
#define UART_BWR_S4_CDET(base, value) (UART_WR_S4_CDET(base, value))
/*@}*/

/*!
 * @name Register UART_S4, field INITF[4] (RO)
 *
 * Indicates that the initial synchronization has failed and the packet cycle
 * time has expired after enabling EN709 register. This flag is cleared if EN709 is
 * cleared.
 *
 * Values:
 * - 0b0 - Initial synchronization has not failed.
 * - 0b1 - Initial synchronization has failed.
 */
/*@{*/
/*! @brief Read current value of the UART_S4_INITF field. */
#define UART_RD_S4_INITF(base) ((UART_S4_REG(base) & UART_S4_INITF_MASK) >> UART_S4_INITF_SHIFT)
#define UART_BRD_S4_INITF(base) (BITBAND_ACCESS8(&UART_S4_REG(base), UART_S4_INITF_SHIFT))
/*@}*/

/*******************************************************************************
 * UART_RPL - UART CEA709.1-B Received Packet Length
 ******************************************************************************/

/*!
 * @brief UART_RPL - UART CEA709.1-B Received Packet Length (RO)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_RPL register
 */
/*@{*/
#define UART_RD_RPL(base)        (UART_RPL_REG(base))
/*@}*/

/*******************************************************************************
 * UART_RPREL - UART CEA709.1-B Received Preamble Length
 ******************************************************************************/

/*!
 * @brief UART_RPREL - UART CEA709.1-B Received Preamble Length (RO)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_RPREL register
 */
/*@{*/
#define UART_RD_RPREL(base)      (UART_RPREL_REG(base))
/*@}*/

